public/materials/handouts/handout-12-why-logic.tex
% Created 2021-11-10 Wed 01:08
% Intended LaTeX compiler: xelatex
\documentclass[12pt]{article}
                           
                           \input{/Users/roambot/.emacs.d/.local/custom-org-latex-classes/notes-setup-file.tex}
\author{Colin McLear}
\date{PHIL 4/880~ |~ November 9, 2021}
\title{The Need for a Science of Logic}
\usepackage[notquote]{hanging}
\begin{document}\makeatletter
\newcommand{\citeprocitem}[2]{\hyper@linkstart{cite}{citeproc_bib_item_#1}#2\hyper@linkend}
\makeatother



\maketitle


\section{Categorialism}
\label{sec:org835fede}

\begin{description}
\item[{Categorialism:}] existence or being has a structure, and the categories
delineate that structure
\end{description}


\begin{itemize}
\item Q: Why do we need a new theory of categories?
\item A: Because prior theories have been inadequate
\begin{enumerate}
\item Unsystematic in their delineation of the categories
\item Subjective in their derivation of the categories
\end{enumerate}
\end{itemize}


\section{Hegel's Criticism of Kant}
\label{sec:orgc1bbb24}

\begin{itemize}
\item Hegel rejects Kant's derivation of the categories in two ways:
\begin{enumerate}
\item The specification of \emph{which} concepts designate or express categories is
historical/empirical/unscientific -- a science of logic must be \emph{presuppositionless}

\begin{quote-b}
Logic, on the contrary, cannot presuppose any of these forms of
reflection, these rules and laws of thinking, for they are part of its
content and they first have to be established within it (SL 23; 21:27)
\end{quote-b}

\item The origin/derivation/basis of the categories results in a kind of
subjectivism or skepticism

\begin{quote-b}
The \emph{critique of the forms of the understanding} [i.e. the categories] has
arrived precisely at this result, namely that such forms do \emph{not apply to
things in themselves}. This can only mean that they are in themselves
something untrue. (SL 26; 21:30)
\end{quote-b}
\end{enumerate}
\end{itemize}

\subsection{Which Categories?}
\label{sec:org2925d84}

\begin{itemize}
\item Kant rejects Aristotle's presentation of the categories because it is
``rhapsodic'' in its method of specifying which concepts express or refer to
categories -- what is needed is a principle that specifies \emph{all} the
categories (completeness) and \emph{only} the categories (exclusiveness) 

\begin{quote-b}
[we need an account of the categories that] has not arisen rhapsodically
from a haphazard search for pure concepts, of the completeness of which one
could never be certain, since one would only infer it through induction,
without reflecting that in this way one would never see why just these and
not other concepts should inhabit the pure understanding. (A81/B106-7)
\end{quote-b}

\item Kant argues that we need a principled account based on reflection on the
forms of judgment

\begin{quote-b}
Transcendental philosophy has the advantage but also the obligation to seek
its concepts in accordance with a principle, since they spring pure and
unmixed from the understanding, as absolute unity, and must therefore be
connected among themselves in accordance with a concept or idea. Such a
connection, however, provides a rule by means of which the place of each
pure concept of the understanding and the completeness of all of them
together can be determined a priori, which would otherwise depend upon whim
or chance. (A67/B92)
\end{quote-b}

\item Hegel rejects Kant's solution (viz. reflection on the forms of judgment) for
being equally unsystematic

\begin{quote-b}
It is well known that the Kantian philosophy made it very easy for itself in
locating the categories. The \emph{I}, the unity of self-consciousness, is quite
abstract and entirely indeterminate. How is one then to arrive at the
\emph{determinations} of the I, the categories? Fortunately, the \emph{various forms of
judgment} are already listed empirically in ordinary logic. Now to judge is
to \emph{think} a determinate object. The various forms of judgment that had
already been enumerated thus provide the various \emph{determinations of thought}.
(EL Â§42A)
\end{quote-b}

\item Hegel's position suggests that he thinks Kant faces a dilemma:
\begin{enumerate}
\item The reflected nature of the categories is merely historical in its
reception of commonly accepted logical forms
\item The reflected nature of the categories is experiential in that it
requires a kind of intellectual experience of acts of the mind to which
one attends and then from which one abstracts to form the relevant concepts
\end{enumerate}
\end{itemize}


\subsection{On What Basis?}
\label{sec:org665ee55}

\begin{itemize}
\item Hegel's second criticism concerns the \emph{origin} of the categories in the
subject's judgmental activity

\begin{quote-b}
When Kant in the \emph{Critique of Pure Reason} (p. 83)[A58/B82], in connection
with logic comes to discuss the old and famous question: \emph{What is truth}?, he
starts by \emph{passing off} as a triviality the nominal definition that it is the
agreement of cognition with its subject matter – a definition which is of
great, indeed of supreme value. If we recall this definition together with
the fundamental thesis of transcendental idealism, namely that \emph{rational
cognition} is incapable of comprehending \emph{things in themselves}, that \emph{reality}
lies \emph{absolutely} outside \emph{the concept}, it is then at once evident that such a
\emph{reason}, one which is incapable of \emph{setting itself in agreement} with its
subject matter, and the \emph{things in themselves}, such as are not in agreement
with the rational concept – a concept that does not agree with reality and a
reality that does not agree with the concept – that these are \emph{untrue
conceptions}. If Kant had measured the idea of an \emph{intuitive understanding}
against that first definition of truth, he would have treated that idea
which expresses the required agreement, not as a figment of thought but
rather as truth. (SL 523; 12:26)
\end{quote-b}

\begin{itemize}
\item This is an objection to Kant's position that is \emph{internal} or ``immanent'' to
Kant's position itself
\item Relies on Kant's twin commitments regarding truth as agreement \&
God's intuitive intellect
\begin{itemize}
\item The problem: the conception of the intuitive intellect entails that
our categories may not apply to being as it fundamentally is (i.e. that
the categories aren't really categories of \emph{being} but rather merely
being for \emph{us})
\end{itemize}
\end{itemize}
\end{itemize}


\subsection{Reconstructing Hegel's Argument}
\label{sec:org0b7fb1a}

\begin{enumerate}
\item God's intuitive intellect represents non-discursively, and thus
non-categorially (definition)
\item God's intellectual intuition is in total/absolute/perfect agreement
with its object (definition)
\item \(\therefore\) God's non-categorial intellectual intuition constitutes an ultimate
standard for truth (as agreement of a representation with its object) (1-2)
\item God's intellect perfectly comprehends all things from their grounds
(definition)
\item \(\therefore\) God truly or perfectly accurately \emph{non}-categorially represents what is
metaphysically fundamental about all things (3-4)
\item If (5) then it is possible that the intuited ways of being are not
identical to those ways of being picked out by the discursive
categories (assumption)
\item \(\therefore\) It is possible that the categories, even when applied correctly, do not
pick out the necessarily fundamental ways of being (5, 6)
\item It cannot be possible that the categories, when correctly applied, do not
pick out the necessarily fundamental ways of being (assumption)
\item Contradiction (7, 8)
\item Therefore \ldots{}
\end{enumerate}
\end{document}
